In [1]:
import pandas as pd
import numpy as np

In [3]:
obj1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d','b', 'a', 'c'])
obj1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj1.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [5]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [6]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [7]:
frame1 = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index=['a', 'b', 'c'],
                     columns=['Ohio', 'Texas', 'California'])
frame1

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [8]:
frame2 = frame1.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [9]:
states = ['Texas', 'Utah', 'California']

In [10]:
frame1.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [13]:
frame1.loc[['a', 'b', 'c', 'd'], states]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [36]:
frame1.loc[['a', 'b', 'c'], ['Ohio', 'Texas', 'California']]

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [37]:
obj1 = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj1

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [39]:
obj2 = obj1.drop('c')
obj2

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [41]:
obj1.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [42]:
obj1

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [43]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
data.drop(['Ohio','Utah'])

          one  two  three  four
Colorado    4    5      6     7
New York   12   13     14    15

In [45]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [46]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [47]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [48]:
obj1.drop('c', inplace=True)

In [49]:
obj1

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [50]:
obj1

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [51]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15